In [1]:
import pandas as pd
import numpy as np
import ssl
ssl._create_default_https_context = ssl._create_unverified_context

[[[ nba 선수 능력치 데이터 ]]]

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/nba/nba.csv', encoding='latin', sep=';')
df.head()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Precious Achiuwa,C,22,TOR,73,28,23.6,3.6,8.3,...,0.595,2.0,4.5,6.5,1.1,0.5,0.6,1.2,2.1,9.1
1,2,Steven Adams,C,28,MEM,76,75,26.3,2.8,5.1,...,0.543,4.6,5.4,10.0,3.4,0.9,0.8,1.5,2.0,6.9
2,3,Bam Adebayo,C,24,MIA,56,56,32.6,7.3,13.0,...,0.753,2.4,7.6,10.1,3.4,1.4,0.8,2.6,3.1,19.1
3,4,Santi Aldama,PF,21,MEM,32,0,11.3,1.7,4.1,...,0.625,1.0,1.7,2.7,0.7,0.2,0.3,0.5,1.1,4.1
4,5,LaMarcus Aldridge,C,36,BRK,47,12,22.3,5.4,9.7,...,0.873,1.6,3.9,5.5,0.9,0.3,1.0,0.9,1.7,12.9

-- Tm 컬럼은 각 팀의 이름을 의미한다. TOR팀의 평균나이를 소수 4째 자리까지 구하여라.

In [59]:
result = df.loc[df['Tm']=='TOR'].Age.mean().round(4)
result2 = round(df.loc[df.Tm=="TOR"].Age.mean(),4)
print(result)
print(result2)

24.8696
24.8696

-- Pos 컬럼은 포지션을 의미한다. 전체 선수 중 최소나이대의 선수들을 필터하고 그들 중 가장 많은 포지션은 무엇인지 확인하라.

In [33]:
result = df.loc[df.Age==df.Age.min()].Pos.value_counts().index[0]
print(result)

SG

-- 선수들의 이름은 first_name + 공백 + last_name으로 이루어져 있다. 가장 많은 first_name은 무엇이며 몇 회 발생하는지 확인하라.

In [46]:
first_name = df.Player.str.split().str[0].str.lower().value_counts().head(1)
print(first_name)

Player
justin    14
Name: count, dtype: int64

-- PTS컬럼은 경기당 평균득점수 이다. 각 포지션별로 경기당 평균득점수의 평균을 구하여라.

In [53]:
result = df.groupby('Pos').PTS.mean().sort_values()
print(result)

Pos
SF        7.270253
SG-SF     7.360000
C         7.690769
PF        7.737500
SG        7.810553
PG        8.325161
PF-SF     8.500000
SF-SG     8.660000
SG-PG     9.525000
C-PF     12.850000
PG-SG    22.000000
Name: PTS, dtype: float64

-- G컬럼은 참여한 경기의 숫자이다. 각 팀별로 가장 높은 경기참여 수를 가진 선수들의 경기 참여 숫자의 평균을 구하여라.

In [61]:
result = df.sort_values(['Tm','G'], ascending=False).groupby('Tm').head(1).G.mean()
print(result)

77.51612903225806

-- TM 의 값이 MIA 이며 Pos 는 C 또는 PF 인 선수의 MP 값의 평균은?

In [65]:
result = df.loc[(df['Tm']=='MIA') & ((df['Pos']=='C')|(df['Pos']=='PF'))].MP.mean()
result2 = df.loc[(df.Tm=='MIA')&(df.Pos.isin(['C','PF']))].MP.mean()
print(result)
print(result2)

16.7875
16.7875

-- 전체 데이터중 G의 평균값의 1.5배 이상인 데이터들만 추출했을때 3P값의 평균은?

In [71]:
result = df.loc[df.G >= df.G.mean()*1.5]['3P'].mean()
print(result)

1.3853658536585365

-- Age의 평균 이상인 그룹과 평균 미만인 그룹간의 G값의 평균의 차이는?

In [72]:
result = df.loc[df.Age >= df.Age.mean()].G.mean() - df.loc[df.Age < df.Age.mean()].G.mean()
print(result)

3.787674551781862

-- 평균 나이가 가장 젊은 팀은 어디인가?

In [77]:
result = df.groupby('Tm').Age.mean().sort_values().index[0]
print(result)

MEM

-- Pos 그룹별 평균 MP 값을 구하여라

In [78]:
result = df.groupby('Pos').MP.mean()
print(result)

Pos
C        16.990000
C-PF     25.350000
PF       17.937500
PF-SF    27.300000
PG       19.547742
PG-SG    37.200000
SF       17.514557
SF-SG    20.340000
SG       18.554271
SG-PG    22.950000
SG-SF    19.620000
Name: MP, dtype: float64

[[[ 넷플릭스 주식 데이터 ]]]

In [65]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/nflx/NFLX.csv')
df.head()

         Date      Open      High       Low     Close  Adj Close     Volume
0  2002-05-23  1.156429  1.242857  1.145714  1.196429   1.196429  104790000
1  2002-05-24  1.214286  1.225000  1.197143  1.210000   1.210000   11104800
2  2002-05-28  1.213571  1.232143  1.157143  1.157143   1.157143    6609400
3  2002-05-29  1.164286  1.164286  1.085714  1.103571   1.103571    6757800
4  2002-05-30  1.107857  1.107857  1.071429  1.071429   1.071429   10154200

★★★★★-- 매년 5월달의 open 가격의 평균값을 데이터 프레임으로 표현하라

In [39]:
df.Date = pd.to_datetime(df.Date)
target = df.groupby(df.Date.dt.strftime('%Y-%m')).mean()
result = target.loc[target.index.str.contains('-05')].Open
print(result)

Date
2002-05      1.155833
2003-05      1.641497
2004-05      4.261143
2005-05      1.951905
2006-05      4.163571
2007-05      3.159351
2008-05      4.435034
2009-05      5.790571
2010-05     14.417071
2011-05     34.650272
2012-05     10.523247
2013-05     31.936429
2014-05     51.121292
2015-05     85.057429
2016-05     92.705715
2017-05    158.255455
2018-05    329.779541
2019-05    359.664548
2020-05    433.880499
2021-05    496.923996
Name: Open, dtype: float64

[[[ 당뇨 여부 판단 데이터 ]]]

In [73]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/diabetes/train.csv')
df.head()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,3,102,74,0,0,29.5,0.121,32,0
1,2,144,58,33,135,31.6,0.422,25,1
2,5,136,82,0,0,0.0,0.640,69,0
3,13,145,82,19,110,22.2,0.245,57,0
4,1,117,60,23,106,33.8,0.466,27,0

-- Outcome 값에 따른 각 그룹의 각 컬럼의 평균 차이를 구하여라

In [49]:
result = df.loc[df.Outcome==1].mean() - df.loc[df.Outcome==0].mean()
result2 = df.groupby('Outcome').mean().diff().iloc[1,:]
print(result)
print(result2)

Pregnancies                  1.574159
Glucose                     29.943995
BloodPressure                3.202079
SkinThickness                2.952033
Insulin                     33.398645
BMI                          4.541437
DiabetesPedigreeFunction     0.143646
Age                          5.866939
Outcome                      1.000000
dtype: float64
Pregnancies                  1.574159
Glucose                     29.943995
BloodPressure                3.202079
SkinThickness                2.952033
Insulin                     33.398645
BMI                          4.541437
DiabetesPedigreeFunction     0.143646
Age                          5.866939
Name: 1, dtype: float64

[[[ 현대 차량 가격 분류문제 데이터 ]]]

In [82]:
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/hyundai/train.csv")
df.head()

,model,year,price,transmission,mileage,fuelType,tax(£),mpg,engineSize
0,Tucson,2016,12795,Manual,36263,Diesel,30,61.7,1.7
1,I10,2012,3995,Manual,22089,Petrol,20,61.4,1.2
2,I30,2019,24000,Manual,555,Petrol,145,34.0,2.0
3,Tucson,2017,12995,Manual,32147,Diesel,30,61.7,1.7
4,Tucson,2018,14991,Semi-Auto,32217,Diesel,150,57.6,1.7

-- 정보(row수)가 가장 많은 상위 3차종의 price값의 각 평균값은?

In [80]:
result = df.loc[df.model.isin(df.model.value_counts().index[:3])].groupby('model').price.mean().to_frame()
print(result)

                price
model
 I10      7646.137891
 I30     11651.821759
 Tucson  15805.441373

[[[ 센서데이터 동작유형 분류 데이터 ]]]

In [102]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/muscle/train.csv")
df.head()

,motion_0,motion_1,motion_2,motion_3,motion_4,motion_5,motion_6,motion_7,motion_8,motion_9,...,motion_55,motion_56,motion_57,motion_58,motion_59,motion_60,motion_61,motion_62,motion_63,pose
0,-6.0,8.0,5.0,6.0,-12.0,-27.0,5.0,24.0,-8.0,-5.0,...,-1.0,-3.0,-6.0,-9.0,-7.0,36.0,68.0,3.0,-3.0,1
1,-32.0,-3.0,-4.0,-5.0,-1.0,16.0,0.0,-5.0,42.0,2.0,...,-17.0,-12.0,-1.0,-1.0,0.0,-26.0,-11.0,-4.0,-9.0,1
2,35.0,-2.0,-1.0,1.0,-25.0,-16.0,-3.0,-20.0,10.0,1.0,...,6.0,-65.0,6.0,-10.0,-31.0,-19.0,-3.0,-47.0,-17.0,0
3,-15.0,-6.0,-3.0,-5.0,27.0,37.0,-2.0,-2.0,19.0,5.0,...,2.0,11.0,0.0,-2.0,-4.0,-7.0,15.0,3.0,14.0,1
4,60.0,3.0,0.0,-7.0,-6.0,-10.0,-6.0,7.0,-11.0,-4.0,...,-12.0,17.0,-3.0,1.0,2.0,-2.0,20.0,18.0,10.0,0

★★★★★★-- pose값에 따른 motion 컬럼의 중간값의 가장 큰 차이를 보이는 motion 컬럼은 어디이며 그값은?

In [138]:
t = df.groupby('pose').median().diff().iloc[1,:].sort_values(ascending=False).reset_index()
result = t.loc[t[1] == t[1].max()].values
result

array([['motion_62', 4.0],
       ['motion_54', 4.0]], dtype=object)

In [134]:
t = df.groupby('pose').median().T
dfs = abs(t[0] - t[1]).sort_values().reset_index()
dfs[dfs[0] == dfs[0].max()].values

array([['motion_54', 4.0],
       ['motion_62', 4.0]], dtype=object)

[[[ 약물 분류 데이터 ]]]

In [130]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/drug/train.csv")
df.head()

   Age Sex      BP Cholesterol  Na_to_K  Drug
0   20   F  NORMAL      NORMAL    9.281     4
1   24   M    HIGH      NORMAL    9.475     1
2   34   M  NORMAL        HIGH   22.456     0
3   17   M  NORMAL      NORMAL   10.832     4
4   72   M     LOW        HIGH   16.310     0

★★★★★-- 남성들의 연령대별 (10살씩 구분 0~9세 10~19세 ...) Na_to_K값의 평균값을 구해서 데이터 프레임으로 표현하여라

In [135]:
df2 = df.loc[df.Sex == 'M']
result = df2.groupby(df2.Age//10*10).Na_to_K.mean().to_frame()
result

       Na_to_K
Age
10   13.627000
20   18.260769
30   15.244143
40   13.897273
50   14.811273
60   14.284308
70   11.363857

[[[ 레드 와인 퀄리티 예측 데이터 ]]]

In [149]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/redwine/train.csv")
df.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,5.0,0.38,0.01,1.6,0.048,26.0,60.0,0.99084,3.70,0.75,14.0,6
1,5.0,0.42,0.24,2.0,0.060,19.0,50.0,0.99170,3.72,0.74,14.0,8
2,7.1,0.36,0.30,1.6,0.080,35.0,70.0,0.99693,3.44,0.50,9.4,5
3,7.6,0.29,0.49,2.7,0.092,25.0,60.0,0.99710,3.31,0.61,10.1,6
4,7.7,0.51,0.28,2.1,0.087,23.0,54.0,0.99800,3.42,0.74,9.2,5

★★★★★-- quality 값이 3인 그룹과 8인 데이터그룹의 각 컬럼별 독립변수의 표준편차 값의 차이를 구할때 그 값이 가장 큰 컬럼명을 구하여라.

In [181]:
df2 = abs(df.loc[df.quality==3].std() - df.loc[df.quality==8].std()).sort_values(ascending=False).index[0]
df2

'total sulfur dioxide'

[[[ 대학원 입학 가능성 데이터 ]]]

In [168]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/admission/train.csv")
df.head()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,CGPA,Research,Chance of Admit
0,246,328,110,4,4.0,2.5,9.02,1,0.81
1,100,323,113,3,4.0,4.0,8.88,1,0.79
2,79,296,95,2,3.0,2.0,7.54,1,0.44
3,53,334,116,4,4.0,3.0,8.00,1,0.78
4,444,321,114,5,4.5,4.5,9.16,1,0.87

★★★★★★★★★★-- Serial No. 컬럼을 제외하고 'Chance to Admit'을 종속변수, 나머지 변수를 독립변수라 할때, 랜덤포레스트를 통해 회귀 예측을 할 때 변수 중요도 값을 출력하라 (시드값에 따라 순서는 달라질 수 있음)

In [180]:
from sklearn.ensemble import RandomForestRegressor

df_t = df.drop([df.columns[0]], axis=1)
x = df_t.drop([df.columns[-1]], axis=1)
y = df_t[df.columns[-1]]

ml = RandomForestRegressor()

ml.fit(x,y)
result = pd.DataFrame({'importance':ml.feature_importances_}, x.columns).sort_values('importance', ascending=False)
print(result)

                   importance
CGPA                 0.811908
GRE Score            0.081735
TOEFL Score          0.036138
LOR                  0.024774
SOP                  0.023432
University Rating    0.014345
Research             0.007667

[[[ 킹카운티 주거지 가격예측문제 데이터 ]]]

In [199]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/kingcountyprice//train.csv")
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,8961990160,20150413T000000,567500.0,3,2.5,2080,4556,2.0,0,0,...,8,2080,0,1999,0,98074,47.6036,-122.014,1530,5606
1,9455200205,20140604T000000,525000.0,3,2.0,1540,7800,1.0,0,0,...,8,1540,0,2004,0,98125,47.7041,-122.288,1510,7800
2,7853220670,20140918T000000,540000.0,3,2.5,2860,8935,2.0,0,0,...,8,2860,0,2004,0,98065,47.5336,-121.855,2650,6167
3,3298201170,20141110T000000,350000.0,3,1.0,940,7811,1.0,0,0,...,6,940,0,1959,0,98008,47.6195,-122.118,1180,7490
4,7972604355,20140521T000000,218000.0,3,1.0,1020,7874,1.0,0,0,...,7,1020,0,1956,0,98106,47.5175,-122.346,1290,7320

-- bedrooms 의 빈도가 가장 높은 값을 가지는 데이터들의 price 의 상위 10%와 하위 10%값의 차이를 구하여라.

In [205]:
t = df.loc[df.bedrooms == df.bedrooms.value_counts().index[0]]
answer = t.price.quantile(0.9) - t.price.quantile(0.1)
print(answer)

505500.0

[[[ 의료 비용 예측 데이터 ]]]

In [210]:
import pandas as pd
train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/MedicalCost/train.csv")
train.head()

   age     sex     bmi  children smoker     region      charges
0   64  female  39.330         0     no  northeast  14901.51670
1   47  female  27.830         0    yes  southeast  23065.42070
2   52  female  33.300         2     no  southwest  10806.83900
3   33  female  22.135         1     no  northeast   5354.07465
4   30    male  31.400         1     no  southwest   3659.34600

★★★★★-- 흡연자와 비흡연자 각각 charges 의 상위 10% 그룹의 평균의 차이는?

In [40]:
smoke_yes = train.loc[train.smoker == 'yes'].charges.quantile(0.9)
smoke_no = train.loc[train.smoker == 'no'].charges.quantile(0.9)

mean_yes = train.loc[(train.smoker == 'yes') & (train.charges >= smoke_yes)].charges.mean()
mean_no = train.loc[(train.smoker == 'no') & (train.charges >= smoke_no)].charges.mean()

result = mean_yes - mean_no
print(result)

29297.954548156144

[[[ 수질 음용성 여부 데이터 ]]]

In [214]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/waters/train.csv")
df.head()

,ph,Hardness,Solids,Chloramines,Sulfate,Conductivity,Organic_carbon,Trihalomethanes,Turbidity,Potability
0,7.918150,214.186611,23823.492888,7.290878,341.173322,411.424483,19.585002,25.057375,4.028958,0
1,5.422446,205.266080,18542.957451,5.491963,306.702227,382.080129,10.504023,67.493450,2.911751,1
2,7.341547,187.672402,21273.457066,7.784003,NaN,332.084293,16.842334,55.019151,4.025644,0
3,9.056245,197.666301,17403.532167,7.688917,337.460176,414.766631,15.349869,63.696746,3.319354,0
4,5.039374,142.860598,40829.353167,7.271543,NaN,386.803057,16.823773,52.297113,4.957420,0

★★★★★-- ph값은 상당히 많은 결측치를 포함한다. 결측치를 제외한 나머지 데이터들 중 사분위값 기준 하위 25%의 값들의 평균값은?

In [48]:
t = df.ph.dropna()
result = t.loc[t <= t.quantile(0.25)].mean()
print(result)

5.057093462441731

[[[ 비행탑승 경험 만족도 데이터 ]]]

In [223]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/airline/train.csv")
df.head()

,id,Gender,Customer Type,Age,Type of Travel,Class,Flight Distance,Inflight wifi service,Departure/Arrival time convenient,Ease of Online booking,...,Inflight entertainment,On-board service,Leg room service,Baggage handling,Checkin service,Inflight service,Cleanliness,Departure Delay in Minutes,Arrival Delay in Minutes,satisfaction
0,55882,Male,Loyal Customer,42,Business travel,Business,473,1,1,3,...,5,5,5,5,3,5,3,3,0.0,satisfied
1,31906,Female,Loyal Customer,31,Business travel,Business,3271,4,4,4,...,3,3,5,5,3,4,3,1,5.0,satisfied
2,85481,Male,Loyal Customer,51,Personal Travel,Eco,214,5,0,5,...,3,4,4,4,4,4,3,2,0.0,satisfied
3,102134,Male,Loyal Customer,44,Business travel,Business,3097,1,1,3,...,4,4,4,4,3,4,5,0,0.0,satisfied
4,31580,Male,Loyal Customer,33,Business travel,Business,3286,1,1,1,...,4,2,5,2,5,1,4,0,0.0,satisfied

★★★★★★★★★★-- Arrival Delay in Minutes 컬럼이 결측치인 데이터들 중 ‘neutral or dissatisfied’ 보다 ‘satisfied’의 수가 더 높은 Class는 어디 인가?

In [65]:
t = df.loc[(df['Arrival Delay in Minutes'].isna())].groupby(['Class','satisfaction'], as_index=False).size().pivot(index='Class', columns='satisfaction')
result = t.loc[t['size']['neutral or dissatisfied'] < t['size']['satisfied']]
result

                                size
satisfaction neutral or dissatisfied satisfied
Class
Business                          36        76

[[[ 핸드폰 가격 예측데이터 ]]]

In [2]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/mobile/train.csv")
df.head()

,battery_power,blue,clock_speed,dual_sim,fc,four_g,int_memory,m_dep,mobile_wt,n_cores,...,px_height,px_width,ram,sc_h,sc_w,talk_time,three_g,touch_screen,wifi,price_range
0,842,0,2.2,0,1,0,7,0.6,188,2,...,20,756,2549,9,7,19,0,0,1,1
1,1021,1,0.5,1,0,1,53,0.7,136,3,...,905,1988,2631,17,3,7,1,1,0,2
2,563,1,0.5,1,2,1,41,0.9,145,5,...,1263,1716,2603,11,2,9,1,1,0,2
3,615,1,2.5,0,0,0,10,0.8,131,6,...,1216,1786,2769,16,8,11,1,0,0,2
4,1821,1,1.2,0,13,1,44,0.6,141,2,...,1208,1212,1411,8,2,15,1,1,0,1

★★★★★-- price_range 의 각 value를 그룹핑하여 각 그룹의 n_cores 의 빈도가 가장높은 value와 그 빈도수를 구하여라

In [94]:
result = df.groupby(['price_range','n_cores']).size().sort_values().groupby(level=0).tail(1)
result

price_range  n_cores
0            2          69
3            5          70
2            4          73
1            1          76
dtype: int64

★★★★★★★★★★-- price_range 값이 3인 그룹에서 상관관계가 2번째로 높은 두 컬럼과 그 상관계수를 구하여라

In [25]:
t = df.loc[df['price_range']==3].corr().unstack().sort_values(ascending=False)
result = t.loc[t!=1].reset_index().iloc[1]
print(result)

level_0          pc
level_1          fc
0          0.635166
Name: 1, dtype: object

[[[ 자동차 보험가입 예측데이터 ]]]

In [43]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/insurance/train.csv")
df.head()

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,188957,Female,25,1,17.0,1,< 1 Year,No,38785.0,152.0,59,0
1,275631,Male,20,1,22.0,0,< 1 Year,No,2630.0,160.0,113,0
2,329036,Female,40,1,41.0,0,1-2 Year,Yes,33165.0,124.0,188,0
3,227288,Female,28,1,30.0,1,< 1 Year,No,29038.0,152.0,233,0
4,300441,Female,50,1,28.0,0,1-2 Year,Yes,31325.0,124.0,258,0

-- Vehicle_Age 값이 2년 이상인 사람들만 필터링 하고 그중에서
Annual_Premium 값이 전체 데이터의 중간값 이상인 사람들을 찾고, 그들의 Vintage값의 평균을 구하여라

In [32]:
result = df.loc[(df['Vehicle_Age']=='> 2 Years') & (df['Annual_Premium']>=df['Annual_Premium'].median())]['Vintage'].mean()
print(result)

154.43647182359118

★★★-- vehicle_age에 따른 각 성별(gender)그룹의 Annual_Premium값의 평균을 구하여 아래 테이블과 동일하게 구현하라

In [56]:
t = df.groupby(['Vehicle_Age', 'Gender'], as_index=False)['Annual_Premium'].mean()
result = t.pivot(index='Vehicle_Age', columns='Gender', values='Annual_Premium')
result

Gender             Female          Male
Vehicle_Age
1-2 Year     30762.245001  30413.088469
< 1 Year     29972.286702  30310.982212
> 2 Years    36108.366374  35303.870627

[[[ 성인 건강검진 데이터 ]]]

In [56]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/smoke/train.csv")
df.head()

,성별코드,연령대코드(5세단위),신장(5Cm단위),체중(5Kg단위),허리둘레,시력(좌),시력(우),청력(좌),청력(우),수축기혈압,...,혈색소,요단백,혈청크레아티닌,(혈청지오티)AST,(혈청지오티)ALT,감마지티피,흡연상태,구강검진수검여부,치아우식증유무,치석
0,F,55,145,55,73.0,0.7,0.5,1.0,1.0,129.0,...,12.9,1.0,0.9,172.0,209.0,15.0,0,Y,0.0,Y
1,M,40,180,55,74.0,1.5,1.5,1.0,1.0,102.0,...,15.6,1.0,0.8,30.0,19.0,23.0,1,Y,0.0,Y
2,F,55,150,50,72.0,1.0,0.2,1.0,1.0,116.0,...,14.1,1.0,1.0,31.0,19.0,10.0,0,Y,0.0,N
3,M,40,170,85,89.0,1.0,0.8,1.0,1.0,124.0,...,16.7,1.0,1.0,26.0,38.0,108.0,1,Y,1.0,Y
4,F,40,155,45,62.0,0.5,1.0,1.0,1.0,127.0,...,12.9,1.0,0.7,20.0,11.0,13.0,0,Y,0.0,N

-- 수축기혈압과 이완기 혈압기 수치의 차이를 새로운 컬럼(‘혈압차’) 으로 생성하고, 연령대 코드별 각 그룹 중 ‘혈압차’ 의 분산이 5번째로 큰 연령대 코드를 구하여라

In [5]:
df['혈압차'] = df['수축기혈압']-df['이완기혈압']
result = df.groupby(['연령대코드(5세단위)'])['혈압차'].var().sort_values(ascending=False).index[4]
print(result)

60

★★★-- 비만도를 나타내는 지표인 WHtR는 허리둘레 / 키로 표현한다. 일반적으로 0.58이상이면 비만으로 분류한다. 데이터중 WHtR 지표상 비만인 인원의 남/여 비율을 구하여라

In [16]:
df['WHtR'] = df['허리둘레']/df['신장(5Cm단위)']
t = df.loc[df.WHtR >= 0.58]['성별코드'].value_counts()
result = t['M']/t['F']
print(result)

1.1693877551020408

[[[ 서비스 이탈 예측 데이터 ]]]

In [70]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/churn/train.csv")
df.head()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,6842,15793491,Cherkasova,714,Germany,Male,26,3,119545.48,2,1,0,65482.94,0
1,8963,15607874,Keane,687,France,Male,38,0,144450.58,1,0,1,137276.83,0
2,7047,15737627,Rivero,589,Germany,Female,20,2,121093.29,2,1,0,3529.72,0
3,7503,15697844,Whitehouse,721,Spain,Female,32,10,0.00,1,1,0,136119.96,1
4,3439,15722404,Carpenter,445,France,Female,30,3,0.00,2,1,1,127939.19,0

-- 남성 이탈(Exited)이 가장 많은 국가(Geography)는 어디이고 이탈 인원은 몇명인가?

In [47]:
result = df.loc[(df.Gender == 'Male') & (df.Exited == 1)]['Geography'].value_counts(ascending=False).head(1)
result2 = df.loc[(df.Gender == 'Male')].groupby('Geography').sum()['Exited'].sort_values(ascending=False).head(1)
print(result)
print(result2)

Geography
Germany    287
Name: count, dtype: int64
Geography
Germany    287
Name: Exited, dtype: int64

-- 카드를 소유(HasCrCard ==1)하고 있으면서 활성멤버(IsActiveMember ==1) 인 고객들의 평균 나이를 소숫점이하 4자리까지 구하여라?

In [49]:
result = df.loc[(df.HasCrCard == 1) & (df.IsActiveMember == 1)]['Age'].mean().round(4)
print(result)

39.6102

-- Balance 값이 중간값 이상을 가지는 고객들의 CreditScore의 표준편차를 소숫점이하 3자리까지 구하여라

In [50]:
result = df.loc[df.Balance >= df.Balance.median()]['CreditScore'].std().round(3)
print(result)

97.295

[[[ 기온 강수량 데이터 ]]]

In [3]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/weather/weather2.csv")
df.head()

                  time  이화동강수  이화동기온  수영동강수  수영동기온
0  2020-01-01 00:00:00    0.1   -3.9    0.0    2.5
1  2020-01-01 01:00:00    0.0   -3.1    0.0    3.4
2  2020-01-01 02:00:00    0.0   -1.8    0.0    3.8
3  2020-01-01 03:00:00    0.0   -0.8    0.0    4.6
4  2020-01-01 04:00:00    0.0   -0.1    0.0    5.1

여름철(6월,7월,8월) 이화동이 수영동보다 높은 기온을 가진 시간대는 몇개인가?

In [76]:
df['time'] = pd.to_datetime(df['time'])
result = df.loc[(df.time.dt.month.isin([6,7,8])) & (df['이화동기온']>df['수영동기온'])]['time'].count()
result2 = len(df.loc[(df.time.dt.month.isin([6,7,8])) & (df['이화동기온']>df['수영동기온'])]['time'])
print(result)
print(result2)

1415
1415

이화동과 수영동의 최대강수량의 시간대를 각각 구하여라

In [28]:
yihwa = df.loc[df['이화동강수'] == df['이화동강수'].max()]['time'].values
suyoung = df.loc[df['수영동강수'] == df['수영동강수'].max()]['time'].values
print(yihwa, suyoung)

t1 = df.loc[df['이화동강수'] == df['이화동강수'].max()].time.dt.strftime('%Y-%m-%d %H:%M:%S').values
t2 = df.loc[df['수영동강수'] == df['수영동강수'].max()].time.dt.strftime('%Y-%m-%d %H:%M:%S').values
print(t1, t2)

['2020-09-30T09:00:00.000000000'] ['2020-07-23T12:00:00.000000000']
['2020-09-30 09:00:00'] ['2020-07-23 12:00:00']

[[[ 대한민국 체력장 데이터 ]]]

In [29]:
import pandas as pd
df =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/body/body.csv')
df.head()

,측정나이,측정회원성별,신장 : cm,체중 : kg,체지방율 : %,이완기혈압(최저) : mmHg,수축기혈압(최고) : mmHg,악력D : kg,앉아윗몸앞으로굽히기 : cm,교차윗몸일으키기 : 회,제자리 멀리뛰기 : cm,등급
0,59.0,M,175.0,70.6,19.2,91.0,150.0,40.6,12.2,30.0,179.0,C
1,40.0,F,161.4,45.8,21.7,62.0,119.0,22.1,16.0,32.0,165.0,B
2,27.0,M,176.6,84.8,19.2,87.0,153.0,45.9,13.2,61.0,216.0,B
3,38.0,M,167.6,76.7,24.7,63.0,132.0,43.6,16.0,45.0,231.0,A
4,21.0,M,165.2,66.2,21.5,83.0,106.0,33.5,10.6,46.0,198.0,C

-- 전체데이터의 수축기혈압(최고) - 이완기혈압(최저)의 평균을 구하여라

In [84]:
result = (df['수축기혈압(최고) : mmHg'] - df['이완기혈압(최저) : mmHg']).mean()
print(result)

52.19539414750672

In [32]:
df.loc[df['측정나이']//10*10 == 50]['신장 : cm'].mean()

164.07490107405314

-- 50~59세의 신장평균을 구하여라

In [33]:
result = df.loc[(df['측정나이'] >= 50) & (df['측정나이'] < 60)]['신장 : cm'].mean()
result2 = df.loc[df['측정나이']//10*10 == 50]['신장 : cm'].mean()
print(result)
print(result2)

164.07490107405314
164.07490107405314

-- 연령대 (20~29 : 20대 …) 별 인원수를 구하여라

In [94]:
result = (df['측정나이']//10*10).value_counts()
df['연령대'] = df['측정나이']//10*10
result2 = df['연령대'].value_counts()
print(result)
print(result2)

측정나이
20.0    5831
30.0    2660
40.0    1801
50.0    1769
60.0    1335
Name: count, dtype: int64
연령대
20.0    5831
30.0    2660
40.0    1801
50.0    1769
60.0    1335
Name: count, dtype: int64

★★★-- 연령대 (20~29 : 20대 …) 별 등급의 숫자를 데이터 프레임으로 표현하라

In [121]:
df['연령대'] = (df['측정나이']//10*10)
result = df.groupby(['연령대','등급'], as_index=False).size()
print(result)

     연령대 등급  size
0   20.0  A  1585
1   20.0  B  1443
2   20.0  C  1455
3   20.0  D  1348
4   30.0  A   743
5   30.0  B   697
6   30.0  C   626
7   30.0  D   594
8   40.0  A   386
9   40.0  B   428
10  40.0  C   455
11  40.0  D   532
12  50.0  A   321
13  50.0  B   410
14  50.0  C   474
15  50.0  D   564
16  60.0  A   314
17  60.0  B   371
18  60.0  C   339
19  60.0  D   311

-- 남성 중 A등급과 D등급의 체지방률 평균의 차이(큰 값에서 작은 값의 차)를 구하여라

In [134]:
result = df.loc[(df['측정회원성별'] == 'M') & (df['등급'] == 'D')]['체지방율 : %'].mean() - df.loc[(df['측정회원성별'] == 'M') & (df['등급'] == 'A')]['체지방율 : %'].mean()
print(result)

7.932086486137521

-- 여성 중 A등급과 D등급의 체중의 평균의 차이(큰 값에서 작은 값의 차)를 구하여라

In [138]:
result = df.loc[(df['측정회원성별'] == 'F') & (df['등급'] == 'D')]['체중 : kg'].mean() - df.loc[(df['측정회원성별'] == 'F') & (df['등급'] == 'A')]['체중 : kg'].mean()
print(result)

5.176211590296504

★★★-- bmi는 자신의 몸무게(kg)를 키의 제곱(m)으로 나눈값이다. 데이터의 bmi 를 구한 새로운 컬럼을 만들고 남성의 bmi 평균을 구하여라

In [142]:
df['bmi'] = df['체중 : kg'] / (df['신장 : cm']/100)**2
result = df.loc[df['측정회원성별'] == 'M']['bmi'].mean()
print(result)

24.46134409819308

-- bmi보다 체지방율이 높은 사람들의 체중평균을 구하여라

In [151]:
df['bmi'] = df['체중 : kg'] / (df['신장 : cm']/100)**2
result = df.loc[df['체지방율 : %'] > df['bmi']]['체중 : kg'].mean()
print(result)

61.7408806392542

-- 남성과 여성의 악력 평균의 차이를 구하여라

In [147]:
result = df.loc[df['측정회원성별'] == 'M']['악력D : kg'].mean() - df.loc[df['측정회원성별'] == 'F']['악력D : kg'].mean()
print(result)

t = df.groupby('측정회원성별')['악력D : kg'].mean()
result2 = t.M - t.F
print(result2)

17.55954185047464
17.55954185047465

-- 남성과 여성의 교차윗몸일으키기 횟수의 평균의 차이를 구하여라

In [152]:
result = df.loc[df['측정회원성별'] == 'M']['교차윗몸일으키기 : 회'].mean() - df.loc[df['측정회원성별'] == 'F']['교차윗몸일으키기 : 회'].mean()
print(result)

t = df.groupby('측정회원성별')['교차윗몸일으키기 : 회'].mean()
result2 = t.M - t.F
print(result2)

14.243156833157627
14.243156833157627

[[[ 포켓몬 정보 데이터 ]]]

In [67]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/pok/Pokemon.csv')
df.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

-- Legendary 컬럼은 전설포켓몬 유무를 나타낸다.전설포켓몬과 그렇지 않은 포켓몬들의 HP평균의 차이를 구하여라

In [9]:
result = df.groupby('Legendary')['HP'].mean().diff()[1]
print(result)

25.55614861329147

-- Type 1은 주속성 Type 2 는 부속성을 나타낸다. 가장 많은 부속성 종류는 무엇인가?

In [18]:
result = df['Type 2'].value_counts().index[0]
print(result)

Flying

-- 가장 많은 Type 1 의 종의 평균 Attack 을 평균 Defense로 나눈값은?

In [21]:
t = df.loc[df['Type 1'] == df['Type 1'].value_counts().index[0]]
result = t['Attack'].mean() / t['Defense'].mean()
print(result)

1.0165238678090576

-- 포켓몬 세대(Generation) 중 가장많은 Legendary를 보유한 세대는 몇세대인가?

In [28]:
result = df.loc[df['Legendary']==True]['Generation'].value_counts().index[0]
print(result)

3

In [95]:
df.iloc[:,5:10].corr().reset_index()

     index        HP    Attack   Defense   Sp. Atk   Sp. Def
0       HP  1.000000  0.422386  0.239622  0.362380  0.378718
1   Attack  0.422386  1.000000  0.438687  0.396362  0.263990
2  Defense  0.239622  0.438687  1.000000  0.223549  0.510747
3  Sp. Atk  0.362380  0.396362  0.223549  1.000000  0.506121
4  Sp. Def  0.378718  0.263990  0.510747  0.506121  1.000000

In [105]:
t = df.iloc[:,5:10].corr().reset_index()
t.columns

Index(['index', 'HP', 'Attack', 'Defense', 'Sp. Atk', 'Sp. Def'], dtype='object')

In [97]:
df.iloc[:,5:10].corr().reset_index().rename(columns={0:'corr'})

     index        HP    Attack   Defense   Sp. Atk   Sp. Def
0       HP  1.000000  0.422386  0.239622  0.362380  0.378718
1   Attack  0.422386  1.000000  0.438687  0.396362  0.263990
2  Defense  0.239622  0.438687  1.000000  0.223549  0.510747
3  Sp. Atk  0.362380  0.396362  0.223549  1.000000  0.506121
4  Sp. Def  0.378718  0.263990  0.510747  0.506121  1.000000

In [96]:
df.iloc[:,5:10].corr()

               HP    Attack   Defense   Sp. Atk   Sp. Def
HP       1.000000  0.422386  0.239622  0.362380  0.378718
Attack   0.422386  1.000000  0.438687  0.396362  0.263990
Defense  0.239622  0.438687  1.000000  0.223549  0.510747
Sp. Atk  0.362380  0.396362  0.223549  1.000000  0.506121
Sp. Def  0.378718  0.263990  0.510747  0.506121  1.000000

★★★★★-- ‘HP’, ‘Attack’, ‘Defense’, ‘Sp. Atk’, ‘Sp. Def’, ‘Speed’ 간의 상관 계수중 가장 절댓값이 큰 두 변수와 그 값을 구하여라

In [58]:
t = df.iloc[:,5:10].corr().unstack().reset_index().rename(columns={0:'corr'})
result = t.loc[t['corr'] != 1].sort_values('corr', ascending=False).iloc[0]
print(result)

level_0     Sp. Def
level_1     Defense
corr       0.510747
Name: 22, dtype: object

★★★★★-- 각 Generation의 Attack으로 오름차순 정렬시 상위 3개 데이터들(18개)의 Attack의 전체 평균을 구하여라

In [61]:
result = df.sort_values(['Generation', 'Attack']).groupby('Generation').head(3).Attack.mean()
print(result)

19.5

-- 각 Generation의 Attack으로 내림차순 정렬시 상위 5개 데이터들(30개)의 Attack의 전체 평균을 구하여라

In [63]:
result = df.sort_values(['Generation', 'Attack'], ascending=False).groupby('Generation').head(5).Attack.mean()
print(result)

157.23333333333332

-- 가장 흔하게 발견되는 (Type1 , Type2) 의 쌍은 무엇인가?

In [75]:
result = df[['Type 1', 'Type 2']].value_counts().head(1)
print(result)

Type 1  Type 2
Normal  Flying    24
Name: count, dtype: int64

★★★-- 한번씩만 존재하는 (Type1 , Type2)의 쌍의 갯수는 몇개인가?

In [82]:
t = df[['Type 1', 'Type 2']].value_counts()
result = t.loc[t == 1].count()
print(result)

39

★★★★★★★★★★-- 한번씩만 존재하는 (Type1 , Type2)의 쌍을 각 세대(Generation)은 각각 몇개씩 가지고 있는가?

In [6]:
target = df[['Type 1', 'Type 2']].value_counts()
target2 = target[target==1]

list = []
for value in target2.reset_index().values:
    t1 = value[0]
    t2 = value[1]

    sp = df[(df['Type 1']==t1) & (df['Type 2']==t2)]
    list.append(sp)

result = pd.concat(list).reset_index(drop=True).Generation.value_counts().sort_index()
print(result)

Generation
1     1
2     4
3     5
4    13
5     7
6     9
Name: count, dtype: int64

[[[ 지역구 에너지 소비량 데이터 ]]]

In [20]:
import pandas as pd
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/consum/Tetuan%20City%20power%20consumption.csv')
df.head()

,DateTime,Temperature,Humidity,Wind Speed,general diffuse flows,diffuse flows,Zone 1 Power Consumption,Zone 2 Power Consumption,Zone 3 Power Consumption
0,1/1/2017 0:00,6.559,73.8,0.083,0.051,0.119,34055.69620,16128.87538,20240.96386
1,1/1/2017 0:10,6.414,74.5,0.083,0.070,0.085,29814.68354,19375.07599,20131.08434
2,1/1/2017 0:20,6.313,74.5,0.080,0.062,0.100,29128.10127,19006.68693,19668.43373
3,1/1/2017 0:30,6.121,75.0,0.083,0.091,0.096,28228.86076,18361.09422,18899.27711
4,1/1/2017 0:40,5.921,75.7,0.081,0.048,0.085,27335.69620,17872.34043,18442.40964

★★★-- DateTime컬럼을 통해 각 월별로 몇개의 데이터가 있는지 데이터 프레임으로 구하여라

In [17]:
df['DateTime'] = pd.to_datetime(df['DateTime'])
result = df['DateTime'].dt.month.value_counts().sort_index().to_frame()
print(result)

          count
DateTime
1          4464
2          4032
3          4464
4          4320
5          4464
6          4320
7          4464
8          4464
9          4320
10         4464
11         4320
12         4320

-- 3월달의 각 시간대별 온도의 평균들 중 가장 낮은 시간대의 온도를 출력하라

In [36]:
df['DateTime'] = pd.to_datetime(df['DateTime'])
t = df[df.DateTime.dt.month == 3]
result = t.groupby(t.DateTime.dt.hour).Temperature.mean().sort_values().values[0]
print(result)

11.506612903225806

-- 3월달의 각 시간대별 온도의 평균들 중 가장 높은 시간대의 온도를 출력하라

In [35]:
df['DateTime'] = pd.to_datetime(df['DateTime'])
t = df.loc[df['DateTime'].dt.month == 3]
result = t.groupby(t.DateTime.dt.hour)['Temperature'].mean().sort_values(ascending=False).values[0]
print(result)

18.393602150537635

-- Zone 1 Power Consumption 컬럼의 value값의 크기가 Zone 2 Power Consumption 컬럼의 value값의 크기보다 큰 데이터들의 Humidity의 평균을 구하여라

In [44]:
result = df.loc[df['Zone 1 Power Consumption'] > df['Zone 2  Power Consumption']]['Humidity'].mean()
print(result)

68.23624448055052

-- 각 zone의 에너지 소비량의 상관관계를 구해서 데이터 프레임으로 표기하라

In [48]:
result = df[['Zone 1 Power Consumption', 'Zone 2  Power Consumption', 'Zone 3  Power Consumption']].corr()
display(result)

,Zone 1 Power Consumption,Zone 2 Power Consumption,Zone 3 Power Consumption
Zone 1 Power Consumption,1.000000,0.834519,0.750733
Zone 2 Power Consumption,0.834519,1.000000,0.570932
Zone 3 Power Consumption,0.750733,0.570932,1.000000

★★★★★-- Temperature의 값이 10미만의 경우 A, 10이상 20미만의 경우 B,20이상 30미만의 경우 C, 그 외의 경우 D라고 할때 각 단계의 데이터 숫자를 구하여라

In [55]:
def target(x):
    if x < 10:
        return 'A'
    elif x < 20:
        return 'B'
    elif x < 30:
        return 'C'
    else:
        return 'D'

df['Grade'] = df.Temperature.map(target)
result = df.Grade.value_counts()
print(result)

Grade
B    26993
C    21105
A     2874
D     1444
Name: count, dtype: int64

In [ ]:
from statsmodels.stats.multicomp import pairwise_tukeyhsd

-- 6월 데이터중 12시의 Temperature의 표준편차를 구하여라

In [57]:
result = df.loc[(df.DateTime.dt.month == 6) & (df.DateTime.dt.hour == 12)]['Temperature'].std()
print(result)

2.0499417827951025

-- 6월 데이터중 12시의 Temperature의 분산을 구하여라

In [58]:
result = df.loc[(df.DateTime.dt.month ==6) & (df.DateTime.dt.hour == 12)].Temperature.var()
print(result)

4.202261312849163

★★★-- Temperature의 평균이상의 Temperature의 값을 가지는 데이터를 Temperature를 기준으로 정렬 했을때 4번째 행의 Humidity 값은?

In [64]:
result = df.loc[df.Temperature >= df.Temperature.mean()].sort_values('Temperature').Humidity.values[3]
print(result)

87.9

-- Temperature의 중간값 이상의 Temperature의 값을 가지는 데이터를Temperature를 기준으로 정렬 했을때 4번째 행의 Humidity 값은?

In [66]:
result = df.loc[df.Temperature >= df.Temperature.median()].sort_values('Temperature').Humidity.values[3]
print(result)

80.3

[[[ 전세계 행복도 지표 데이터 ]]]

In [3]:
import pandas as pd
df =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/happy2/happiness.csv',encoding='utf-8')
df.head()

,행복랭킹,나라명,점수,상대GDP,사회적지원,행복기대치,선택의 자유도,관대함,부패에 대한인식,년도
0,1,Finland,7.769,1.340,1.587,0.986,0.596,0.153,0.393,2019
1,2,Denmark,7.600,1.383,1.573,0.996,0.592,0.252,0.410,2019
2,3,Norway,7.554,1.488,1.582,1.028,0.603,0.271,0.341,2019
3,4,Iceland,7.494,1.380,1.624,1.026,0.591,0.354,0.118,2019
4,5,Netherlands,7.488,1.396,1.522,0.999,0.557,0.322,0.298,2019

-- 데이터는 2018년도와 2019년도의 전세계 행복 지수를 표현한다. 각년도의 행복랭킹 10위를 차지한 나라의 행복점수의 평균을 구하여라

In [72]:
result = df.loc[df['행복랭킹']==10]['점수'].mean()
print(result)

7.259

-- 데이터는 2018년도와 2019년도의 전세계 행복 지수를 표현한다. 각년도의 행복랭킹 50위이내의 나라들의 각각의 행복점수 평균을 데이터프레임으로 표시하라

In [93]:
result = df.loc[df['행복랭킹']<=50][['년도','점수']].groupby('년도').mean()
print(result)

           점수
년도
2018  6.64678
2019  6.67002

-- 2018년도 데이터들만 추출하여 행복점수와 부패에 대한 인식에 대한 상관계수를 구하여라

In [117]:
result = df.loc[df['년도']==2018][['점수','부패에 대한인식']].corr().iloc[0,1]
print(result)

0.40529152271510027

★★★★★★★★★★-- 2018년도와 2019년도의 행복랭킹이 변화하지 않은 나라명의 수를 구하여라

In [176]:
result = len(df[['행복랭킹','나라명']])-len(df[['행복랭킹','나라명']].drop_duplicates())
print(result)

15

★★★★★★★★★★-- 2019년도 데이터들만 추출하여 각변수간 상관계수를 구하고 내림차순으로 정렬한 후 상위 5개를 데이터 프레임으로 출력하라. 컬럼명은 v1,v2,corr으로 표시하라

In [4]:
t = df.drop('나라명',axis=1).loc[df['년도']==2019].corr().unstack().to_frame().reset_index().dropna()
tt = t[t[0] != 1].sort_values(0, ascending=False).drop_duplicates(0)
answer = tt.head(5).reset_index(drop=True)
answer.columns = ['v1','v2','corr']
display(answer)

      v1     v2      corr
0  행복기대치  상대GDP  0.835462
1  상대GDP     점수  0.793883
2  행복기대치     점수  0.779883
3  사회적지원     점수  0.777058
4  사회적지원  상대GDP  0.754906

-- 각 년도별 하위 행복점수의 하위 5개 국가의 평균 행복점수를 구하여라

In [245]:
result = df.groupby(['년도']).tail(5).groupby('년도')['점수'].mean()
print(result)

년도
2018    3.1800
2019    3.1408
Name: 점수, dtype: float64

-- 2019년 데이터를 추출하고 해당데이터의 상대 GDP 평균 이상의 나라들과 평균 이하의 나라들의 행복점수 평균을 각각 구하고 그 차이값을 출력하라

In [32]:
target = df.loc[df['년도']==2019]
upper = target.loc[target['상대GDP']>=target['상대GDP'].mean()]['점수'].mean()
lower = target.loc[target['상대GDP']<=target['상대GDP'].mean()]['점수'].mean()
result = upper - lower
print(result)

1.390483957219251

★★★★★-- 각년도의 부패에 대한인식을 내림차순 정렬했을때 상위 20개 국가의 부패에 대한인식의 평균을 구하여라

In [59]:
result = df.sort_values(['년도','부패에 대한인식'], ascending=False).groupby('년도').head(20).groupby('년도')['부패에 대한인식'].mean()
print(result)

년도
2018    0.3267
2019    0.3201
Name: 부패에 대한인식, dtype: float64

★★★★★-- 2018년도 행복랭킹 50위 이내에 포함됐다가 2019년 50위 밖으로 밀려난 국가의 숫자를 구하여라

In [64]:
result = set(df[(df['년도']==2018)&(df['행복랭킹']<=50)]['나라명']) - set(df[(df['년도']==2019)&(df['행복랭킹']<=50)]['나라명'])
print(len(result))

4

★★★★★★★★★★-- 2018년, 2019년 모두 기록이 있는 나라들 중 년도별 행복점수가 가장 증가한 나라와 그 증가 수치는?

In [5]:
count = df['나라명'].value_counts()
target = count[count >= 2].index

df2 = df.copy()
multiple = df2[df2['나라명'].isin(target)].reset_index(drop=True)
multiple.loc[multiple['년도'] == 2018, '점수'] = multiple[multiple['년도'] == 2018]['점수'].values * (-1)
result = multiple.groupby('나라명').sum()['점수'].sort_values().to_frame().iloc[-1]
result

점수    0.87
Name: Burundi, dtype: float64

[[[ 서울시 따릉이 이용정보 데이터 ]]]

In [2]:
import pandas as pd
df =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bicycle/seoul_bi.csv')
df.head()

         대여일자  대여시간  대여소번호 대여구분코드 성별 연령대코드  이용건수    운동량   탄소량     이동거리  사용시간
0  2021-06-01     0   3541    정기권  F  ~10대     1   0.00  0.00     0.00     8
1  2021-06-01     0    765    정기권  F  ~10대     1  27.21  0.35  1526.81    19
2  2021-06-01     0   2637    정기권  F  ~10대     1  41.40  0.37  1608.56    18
3  2021-06-01     0   2919    정기권  F  ~10대     1   0.00  0.00     0.00    75
4  2021-06-01     0    549    정기권  F  ~10대     1  13.04  0.17   731.55     6

-- 대여일자별 데이터의 수를 데이터프레임으로 출력하고, 가장 많은 데이터가 있는 날짜를 출력하라

In [26]:
result = df.groupby('대여일자')['대여일자'].count().to_frame()
result2 = df['대여일자'].value_counts().sort_index().to_frame()
display(result)
display(result2)
answer = result.loc[result['대여일자'] == result['대여일자'].max()].index[0]
print(answer)

             대여일자
대여일자
2021-06-01  48081
2021-06-02  56100
2021-06-03  18985
2021-06-04  56788
2021-06-05  52730
2021-06-06  47787
2021-06-07  52623
2021-06-08  55623
2021-06-09  54507
2021-06-10  36992
2021-06-11  52089
2021-06-12  48569
2021-06-13  43131
2021-06-14  54945

            count
대여일자
2021-06-01  48081
2021-06-02  56100
2021-06-03  18985
2021-06-04  56788
2021-06-05  52730
2021-06-06  47787
2021-06-07  52623
2021-06-08  55623
2021-06-09  54507
2021-06-10  36992
2021-06-11  52089
2021-06-12  48569
2021-06-13  43131
2021-06-14  54945

2021-06-04

-- 각 일자의 요일을 표기하고 (‘Monday’ ~’Sunday’) ‘day_name’컬럼을 추가하고 이를 이용하여 각 요일별 이용 횟수의 총합을 데이터 프레임으로 출력하라

In [27]:
df['대여일자'] = pd.to_datetime(df['대여일자'])
df['day_name'] = df['대여일자'].dt.day_name()

result = df['day_name'].value_counts().to_frame()
print(result)

            count
day_name
Wednesday  110607
Friday     108877
Monday     107568
Tuesday    103704
Saturday   101299
Sunday      90918
Thursday    55977

★★★★★★★★★★-- 각 요일별 가장 많이 이용한 대여소의 이용횟수와 대여소 번호를 데이터 프레임으로 출력하라

In [28]:
result = df.groupby(['day_name', '대여소번호']).size().to_frame('size').sort_values(['day_name', 'size'], ascending=False).reset_index()
answer = result.drop_duplicates('day_name', keep='first').reset_index(drop=True)
display(answer)

    day_name  대여소번호  size
0  Wednesday    502   282
1    Tuesday    502   267
2   Thursday   2715   137
3     Sunday    502   372
4   Saturday    502   378
5     Monday    502   242
6     Friday    502   277

★★★★★★★★★★-- 나이대별 대여구분 코드의 (일일권/전체횟수) 비율을 구한 후 가장 높은 비율을 가지는 나이대를 확인하라. 일일권의 경우 일일권 과 일일권(비회원)을 모두 포함하라

In [29]:
daily = df.loc[df['대여구분코드'].isin(['일일권', '일일권(비회원)'])].value_counts(['연령대코드']).sort_index()
total = df.value_counts(['연령대코드']).sort_index()
result = (daily/total).sort_values(ascending=False)
print(result)
print(result.index[0])

연령대코드
~10대     0.312525
20대      0.239913
30대      0.166702
40대      0.110585
50대      0.065414
70대~     0.048962
60대      0.042462
Name: count, dtype: float64
('~10대',)

-- 연령대별 평균 이동거리를 구하여라

In [30]:
result = df.groupby('연령대코드')['이동거리'].mean()
result2 = df[['연령대코드','이동거리']].groupby('연령대코드').mean()

print(result)
print(result2)

연령대코드
20대     3211.890552
30대     3341.443859
40대     3514.857416
50대     3593.668100
60대     3538.145737
70대~    3085.039641
~10대    2634.426279
Name: 이동거리, dtype: float64
              이동거리
연령대코드
20대    3211.890552
30대    3341.443859
40대    3514.857416
50대    3593.668100
60대    3538.145737
70대~   3085.039641
~10대   2634.426279

★★★★★-- 연령대 코드가 20대인 데이터를 추출하고,이동거리값이 추출한 데이터의 이동거리값의 평균 이상인 데이터를 추출한다.최종 추출된 데이터를 대여일자, 대여소 번호 순서로 내림차순 정렬 후 1행부터 200행까지의 탄소량의 평균을 소숫점 3째 자리까지 구하여라

In [44]:
target = df.loc[df['연령대코드']=='20대']
target2 = target.loc[t['이동거리'] >= target['이동거리'].mean()]
target2['탄소량'] = target2['탄소량'].astype('float')
result = target2.sort_values(['대여일자', '대여소번호'], ascending=False).iloc[:200]['탄소량'].mean().round(3)
print(result)

1.613

C:\Users\user\AppData\Local\Temp\ipykernel_17468\2379115982.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  target2['탄소량'] = target2['탄소량'].astype('float')

★★★-- 6월 7일 ~10대의 “이용건수”의 중앙값은?

In [53]:
df['대여일자'] = pd.to_datetime(df['대여일자'])
result = df.loc[(df['대여일자']==pd.to_datetime('2021-06-07')) & (df['연령대코드']=='~10대'),'이용건수'].median()
print(result)

1.0

★★★★★★★★★★-- 평일 (월~금) 출근 시간대(오전 6,7,8시)의 대여소별 이용 횟수를 구해서 데이터 프레임 형태로 표현한 후 각 대여시간별 이용 횟수의 상위 3개 대여소와 이용횟수를 출력하라

In [88]:
target = df.loc[(df['day_name'].isin(['Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Monday'])) & (df['대여시간'].isin([6,7,8]))].groupby(['대여시간', '대여소번호']).size().to_frame('이용횟수')
result = target.sort_values(['대여시간','이용횟수'], ascending=False).groupby('대여시간').head(3)
print(result)

            이용횟수
대여시간 대여소번호
8    2701    119
     646     115
     1152     92
7    259     104
     230      77
     726      77
6    2744     45
     1125     40
     1028     36

-- 이동거리의 평균 이상의 이동거리 값을 가지는 데이터를 추출하여 추출데이터의 이동거리의 표본표준편차 값을 구하여라

In [89]:
result = df.loc[df['이동거리'] >= df['이동거리'].mean()]['이동거리'].std()
print(result)

5092.139707505356

★★★★★-- 남성(‘M’ or ‘m’)과 여성(‘F’ or ‘f’)의 이동거리값의 평균값을 구하여라

In [102]:
df.loc[df['성별'].isin(['M','m']), 'sex'] = '남'
df.loc[df['성별'].isin(['F','f']), 'sex'] = '여'
result = df.groupby('sex')['이동거리'].mean()
print(result)

df['sex'] = df['성별'].map(lambda x: '남' if x in ['M', 'm'] else '여')
answer = df[['sex', '이동거리']].groupby('sex').mean()
print(answer)

sex
남    3209.110871
여    3468.575025
Name: 이동거리, dtype: float64
            이동거리
sex
남    3209.110871
여    3468.575025

[[[ 월드컵 출전선수 골기록 데이터 ]]]

In [34]:
import pandas as pd

df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/worldcup/worldcupgoals.csv')
df.head()

           Player  Goals                Years  Country
0  Miroslav Klose     16  2002-2006-2010-2014  Germany
1         Ronaldo     15       1998-2002-2006   Brazil
2     Gerd Muller     14            1970-1974  Germany
3   Just Fontaine     13                 1958   France
4            Pele     12  1958-1962-1966-1970   Brazil

★★★-- 주어진 전체 기간의 각 나라별 골득점수 상위 5개 국가와 그 득점수를 데이터프레임형태로 출력하라

In [8]:
result = df.groupby('Country')['Goals'].sum().sort_values(ascending=False).head(5)
print(result)

Country
Brazil       228
Germany      226
Argentina    135
Italy        123
France       115
Name: Goals, dtype: int64

-- 주어진 전체기간동안 골득점을 한 선수가 가장 많은 나라 상위 5개 국가와 그 선수 숫자를 데이터 프레임 형식으로 출력하라

In [9]:
result = df.groupby('Country')['Player'].size().sort_values(ascending=False).head(5)
print(result)

Country
Brazil       81
Germany      78
Italy        60
Argentina    59
France       58
Name: Player, dtype: int64

★★★★★★★★★★-- Years 컬럼은 년도 -년도 형식으로 구성되어있고, 각 년도는 4자리 숫자이다. 년도 표기가 4자리 숫자로 안된 케이스가 존재한다. 해당 건은 몇건인지 출력하라

In [98]:
df['YearsList'] = df.Years.str.split('-')

def check4(x):
    for value in x:
        if len(str(value)) != 4:
            return False
        else:
            return True

df['check'] = df['YearsList'].apply(check4)
result = len(df[df.check == False])
print(result)

45

-- Q3에서 발생한 예외 케이스를 제외한 데이터프레임을 df2라고 정의하고 데이터의 행의 숫자를 출력하라 (아래 문제부터는 df2로 풀이하겠습니다)

In [99]:
df2 = df.loc[df.check == True].reset_index(drop=True)
print(df2.shape[0])
print(len(df2))

1250
1250

★★★★★-- 월드컵 출전횟수를 나타내는 ‘LenCup’ 컬럼을 추가하고 4회 출전한 선수의 숫자를 구하여라

In [100]:
df2['LenCup'] = df2.YearsList.str.len()
result = df2.loc[df2.LenCup == 4].Player.count()
result2 = df2.LenCup.value_counts()[4]
print(result)
print(result2)

16
16

-- Yugoslavia 국가의 월드컵 출전횟수가 2회인 선수들의 숫자를 구하여라

In [101]:
df2.loc[(df2.Country == 'Yugoslavia') & (df2.LenCup == 2)].Player.count()

7

★★★-- 2002년도에 출전한 전체 선수는 몇명인가?

In [102]:
result = df2.loc[df2.Years.str.contains('2002')].Player.count()
result2 = len(df2.loc[df2.Years.str.contains('2002')])
print(result)
print(result2)

156
156

★★★-- 이름에 ‘carlos’ 단어가 들어가는 선수의 숫자는 몇 명인가? (대, 소문자 구분 x)

In [103]:
result = df2.loc[df2.Player.str.lower().str.contains('carlos')].Player.count()
result2 = len(df2.loc[df2.Player.str.lower().str.contains('carlos')])
print(result)
print(result2)

13
13

★★★-- 월드컵 출전 횟수가 1회뿐인 선수들 중에서 가장 많은 득점을 올렸던 선수는 누구인가?

In [122]:
result = df2.loc[df2.LenCup == 1].sort_values('Goals', ascending=False).Player.values[0]
print(result)

Just Fontaine

-- 월드컵 출전횟수가 1회 뿐인 선수들이 가장 많은 국가는 어디인가?

In [140]:
result = df2.loc[df2.LenCup == 1].groupby(['Country']).size().sort_values(ascending=False).index[0]
result2 = df2.loc[df2.LenCup ==1].Country.value_counts().index[0]
print(result)
print(result2)

Brazil
Brazil

[[[ 유튜브 공법컨텐츠 동영상 데이터 ]]]

In [3]:
import pandas as pd


channel =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/youtube/channelInfo.csv')
video =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/youtube/videoInfo.csv')
display(channel.head())
display(video.head())

,channelid,subcnt,viewcnt,videocnt,ct,channelname
0,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,410238653,736,2021-09-30 03:01:03,꽈뚜룹
1,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,412531322,736,2021-09-30 09:01:03,꽈뚜룹
2,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,412531322,735,2021-09-30 15:01:03,꽈뚜룹
3,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,412531322,737,2021-09-30 21:01:03,꽈뚜룹
4,UCkQCwnkQfgSuPTTnw_Y7v7w,1320000,412531322,737,2021-10-01 03:01:04,꽈뚜룹

,videopk,viewcnt,likecnt,dislikecnt,favoritecnt,cmcnt,ct,videoname
0,c5JQp6xafqc,1667010,30474,706,0,6587,2021-10-10 15:20:03,공범 EP1
1,c5JQp6xafqc,1669089,30495,707,0,6589,2021-10-10 15:30:03,공범 EP1
2,c5JQp6xafqc,1674759,30522,711,0,6596,2021-10-10 15:40:02,공범 EP1
3,c5JQp6xafqc,1677026,30555,712,0,6604,2021-10-10 15:50:03,공범 EP1
4,c5JQp6xafqc,1681824,30585,713,0,6600,2021-10-10 16:00:03,공범 EP1

-- 각 데이터의 ‘ct’컬럼을 시간으로 인식할수 있게 datatype을 변경하고 video 데이터의 videoname의 각 value 마다 몇개의 데이터씩 가지고 있는지 확인하라

In [69]:
channel['ct'] = pd.to_datetime(channel['ct'])
video['ct'] = pd.to_datetime(video['ct'])
result = video['videoname'].value_counts()
print(result)

videoname
 공범 EP1    3492
 공범 EP2    3204
 공범 EP3    2568
 공범 EP4    2280
 공범 EP5    1562
 공범 EP6    1274
 공범 EP7     555
 공범 EP8     266
Name: count, dtype: int64

★★★★★★★★★-- 수집된 각 video의 가장 최신화 된 날짜의 viewcount값을 출력하라

In [176]:
result = video.sort_values(['videoname','ct']).drop_duplicates('videoname', keep='last')[['videoname','ct','viewcnt']].reset_index(drop=True)
print(result)

  videoname                  ct  viewcnt
0    공범 EP1 2021-11-01 15:30:03  3180532
1    공범 EP2 2021-11-01 15:30:03  2199328
2    공범 EP3 2021-11-01 15:30:03  1671294
3    공범 EP4 2021-11-01 15:30:03  1818493
4    공범 EP5 2021-11-01 15:30:04  1503435
5    공범 EP6 2021-11-01 15:30:04  1750222
6    공범 EP7 2021-11-01 15:30:05  1630200
7    공범 EP8 2021-11-01 15:30:05  1289088

★★★★★-- Channel 데이터중 2021-10-03일 이후 각 채널의 처음 기록 됐던 구독자 수(subcnt)를 출력하라

In [192]:
target = channel.loc[channel.ct >= channel.ct.dt.strftime('2021-10-04')]
target.sort_values(['ct','channelname']).drop_duplicates('channelname', keep='first')[['channelname','subcnt']].reset_index(drop=True)

        channelname   subcnt
0            논리왕 전기   921000
1             야전삽짱재   257000
2   와글와글 WagleWagle    55000
3        츄정ChuJeong   322000
4     곽토리 kwak tori   471000
5        김농밀의 농밀한 삶     7530
6       릴펄 Lilpearl    10100
7               조나단   215000
8           형사!탐정되다    14900
9     Balming Tiger    54400
10              꽈뚜룹  1330000

-- 각채널의 2021-10-03 03:00:00 ~ 2021-11-01 15:00:00 까지 구독자수 (subcnt) 의 증가량을 구하여라

In [50]:
start = channel.loc[channel.ct.dt.strftime('%Y-%m-%d %H') == '2021-10-03 03'].sort_values(['channelname','ct']).drop_duplicates('channelname')[['channelname','subcnt']].reset_index(drop=True)
end = channel.loc[channel.ct.dt.strftime('%Y-%m-%d %H') == '2021-11-01 15'].sort_values(['channelname','ct']).drop_duplicates('channelname')[['channelname','subcnt']].reset_index(drop=True)
start.columns = ['channelname', 'start_cnt']
end.columns = ['channelname', 'end_cnt']

result = pd.merge(start, end)
result['증가량'] = result.end_cnt - result.start_cnt
result[['channelname','증가량']]

        channelname    증가량
0     Balming Tiger   2500
1     곽토리 kwak tori  -2000
2        김농밀의 농밀한 삶   1540
3               꽈뚜룹  70000
4            논리왕 전기 -11000
5       릴펄 Lilpearl  11000
6             야전삽짱재  11000
7   와글와글 WagleWagle      0
8               조나단  12000
9        츄정ChuJeong   1000
10          형사!탐정되다  10300

★★★★★★★★★★-- 각 비디오는 10분 간격으로 구독자수, 좋아요, 싫어요수, 댓글수가 수집된것으로 알려졌다. 공범 EP1의 비디오정보 데이터중 수집간격이 5분 이하, 20분이상인 데이터 구간( 해당 시점 전,후) 의 시각을 모두 출력하라

In [79]:
import datetime

ep_one = video.loc[video.videoname.str.contains('EP1')].sort_values('ct').reset_index(drop=True)
ep_one[(ep_one.ct.diff(1) >= datetime.timedelta(minutes=20)) | (ep_one.ct.diff(1) <= datetime.timedelta(minutes=5))]
result = ep_one.loc[ep_one.index.isin([720,721,722,723,1635,1636,1637])]
result

,videopk,viewcnt,likecnt,dislikecnt,favoritecnt,cmcnt,ct,videoname
720,c5JQp6xafqc,2153676,34104,830,0,7120,2021-10-12 19:20:03,공범 EP1
721,c5JQp6xafqc,2228250,34559,849,0,7191,2021-10-13 09:41:37,공범 EP1
722,c5JQp6xafqc,2228250,34559,849,0,7191,2021-10-13 09:41:37,공범 EP1
723,c5JQp6xafqc,2228669,34566,849,0,7194,2021-10-13 09:50:03,공범 EP1
1635,c5JQp6xafqc,2706691,37893,987,0,7410,2021-10-19 17:50:02,공범 EP1
1636,c5JQp6xafqc,2707933,37901,988,0,7410,2021-10-19 18:20:03,공범 EP1
1637,c5JQp6xafqc,2708448,37903,988,0,7410,2021-10-19 18:30:03,공범 EP1

-- 각 에피소드의 시작날짜(년-월-일)를 에피소드 이름과 묶어 데이터 프레임으로 만들고 출력하라

-- “공범” 컨텐츠의 경우 19:00시에 공개 되는것으로 알려져있다. 공개된 날의 21시의 viewcnt, ct, videoname 으로 구성된 데이터 프레임을 viewcnt를 내림차순으로 정렬하여 출력하라

-- video 정보의 가장 최근 데이터들에서 각 에피소드의 싫어요/좋아요 비율을 ratio 컬럼으로 만들고 videoname, ratio로 구성된 데이터 프레임을 ratio를 오름차순으로 정렬하라

-- 2021-11-01 00:00:00 ~ 15:00:00까지 각 에피소드별 viewcnt의 증가량을 데이터 프레임으로 만드시오

-- video 데이터 중에서 중복되는 데이터가 존재한다. 중복되는 각 데이터의 시간대와 videoname 을 구하여라

[[[ 유튜브 인기동영상 데이터 ]]]

In [3]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/youtube/youtube.csv",index_col=0)
df.head()

,title,channelTitle,categoryId,view_count,likes,dislikes,comment_count,channelId,trending_date2
0,[신병] 물자창고,장삐쭈,23,1893473,38249,730,8595,UChbE5OZQ6dRHECsX0tEPEZQ,2021-01-01
1,RAIN(비) - 나로 바꾸자 Switch to me (duet with JYP) MV,RAIN's Official Channel,10,2600864,0,0,20129,UCxXgIeE5hxWxHG6dz9Scg2w,2021-01-01
2,2020년 제야의 종 온라인 타종행사 | 보신각 현장 행사는 진행하지 않습니다.,서울시 · Seoul,29,347049,3564,120,178,UCZUPZW5idAxYp-Asj__lVAA,2021-01-01
3,고기남자의 칠면조 파티,고기남자 MeatMan,26,528458,15372,280,3470,UCT3CumbFIJiW33uq0UI3zlg,2021-01-01
4,골목 3mc를 분노하게 만든 마음고생이 심했을 공릉 백반집 사장님의 푸념?! [예능...,스브스밥집,24,494904,3918,111,3142,UCdWgRSfttvDucq4ApcCg5Mw,2021-01-01

-- 인기동영상 제작횟수가 많은 채널 상위 10개명을 출력하라 (날짜기준, 중복포함)

-- 논란으로 인기동영상이 된 케이스를 확인하고 싶다. dislikes수가 like 수보다 높은 동영상을 제작한 채널을 모두 출력하라

-- 채널명을 바꾼 케이스가 있는지 확인하고 싶다. channelId의 경우 고유값이므로 이를 통해 채널명을 한번이라도 바꾼 채널의 갯수를 구하여라

-- 일요일에 인기있었던 영상들중 가장많은 영상 종류(categoryId)는 무엇인가?

-- 각 요일별 인기 영상들의 categoryId는 각각 몇개 씩인지 하나의 데이터 프레임으로 표현하라

-- 댓글의 수로 (comment_count) 영상 반응에 대한 판단을 할 수 있다. viewcount대비 댓글수가 가장 높은 영상을 확인하라 (view_count값이 0인 경우는 제외한다)

-- 댓글의 수로 (comment_count) 영상 반응에 대한 판단을 할 수 있다.viewcount대비 댓글수가 가장 낮은 영상을 확인하라 (view_counts, ratio값이 0인경우는 제외한다.)

-- like 대비 dislike의 수가 가장 적은 영상은 무엇인가? (like, dislike 값이 0인경우는 제외한다)

-- 가장많은 트렌드 영상을 제작한 채널의 이름은 무엇인가? (날짜기준, 중복포함)

-- 20회(20일)이상 인기동영상 리스트에 포함된 동영상의 숫자는?

[[[ 5회 기출 변형 ]]]

[ 작업유형 1 ]

In [5]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p1_1_.csv')
df.head(5)

,시도명,시군구명,종량제봉투종류,종량제봉투처리방식,종량제봉투용도,종량제봉투사용대상,1L가격,1.5L가격,2L가격,2.5L가격,...,60L가격,75L가격,100L가격,120L가격,125L가격,관리부서명,관리부서전화번호,데이터기준일자,제공기관코드,제공기관명
0,경기도,안양시,규격봉투,매립용,생활쓰레기,사업장용,0,0,0,0,...,0,2100,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
1,경기도,안양시,규격봉투,매립용,생활쓰레기,기타,0,0,0,0,...,0,2100,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
2,경기도,안양시,규격봉투,소각용,음식물쓰레기,가정용,0,50,0,80,...,0,0,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
3,경기도,안양시,규격봉투,소각용,음식물쓰레기,사업장용,0,50,0,80,...,0,0,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
4,경기도,안양시,규격봉투,소각용,음식물쓰레기,기타,0,50,0,80,...,0,0,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시

-- 20L가격과 5L가격이 모두 0원이 아닌 데이터만 필터를 한 후, 각 row별로 20L가격과 5L가격의 차이를 ‘차이가격’ 이라 부른다고 하자. 시도명 별 차이가격의 평균가격을 비교할때 그 값이 가장 큰 금액을 반올림하여 소숫점 이하 1자리까지 구하여라

In [13]:
target = df.loc[(df['5L가격'] != 0) & (df['20L가격'] != 0)]
target['가격차이'] = target['20L가격']-target['5L가격']
result = target.groupby('시도명')['가격차이'].mean().max().round(1)
print(result)

619.0

C:\Users\user\AppData\Local\Temp\ipykernel_24600\3564479289.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  target['가격차이'] = target['20L가격']-target['5L가격']

In [26]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p1_2_.csv')
df.head(5)

       ID  height(cm)  weight(kg)
0  user_1       173.0        67.5
1  user_2       149.5        82.5
2  user_3       143.8        64.6
3  user_4       163.1        87.2
4  user_5       159.6        77.1

-- BMI는 몸무게(kg) / (키(M) * 키(M)) 로 정의 된다. 초고도 비만은 BMI 25이상 , 고도 비반은 BMI 25미만 - 23이상 , 정상은 23미만 - 18.5이상 저체중은 18.5미만으로 정의 된다. 주어진 데이터에서 초고도비만 인원 + 저체중 인원 의 숫자는?

In [32]:
df['BMI'] = df['weight(kg)']/(df['height(cm)']*0.01)**2
df.loc[df.BMI >= 25]['ID'].count() + df.loc[df.BMI < 18.5]['ID'].count()
len(df.loc[df.BMI >= 25]) + len(df.loc[df.BMI < 18.5])

8998

In [31]:
df['BMI'] = df['weight(kg)']/(df['height(cm)']*0.01)**2
condition_list = [(df.BMI >= 25), (df.BMI >= 23)&(df.BMI < 25), (df.BMI < 23)&(df.BMI >= 18.5), (df.BMI < 18.5)]
choice_list = ['초고도', '고도', '정상', '저체중']
df['판정'] = np.select(condition_list, choice_list)
# df.loc[df['판정'].isin(['초고도', '저체중'])]['ID'].count()
len(df.loc[df['판정'].isin(['초고도', '저체중'])])

8998

In [34]:
def check(x):
    if x >=25:
        return "초고도"
    elif x>=23:
        return "고도"
    elif x>=18.5:
        return "정상"
    else:
        return "저체중"

df['BMI'] = df['weight(kg)']/(df['height(cm)']*0.01)**2
df['판정'] = df['BMI'].map(check)
result = df[df['판정'].isin(['초고도', '저체중'])].shape[0]
print(result)

8998

In [23]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p1_3.csv')
df.head(5)

,지역,초등학교_전출_도내,초등학교_전출_도외,초등학교_전입_도내,초등학교_전입_도외,중학교_전출_도내,중학교_전출_도외,중학교_전입_도내,중학교_전입_도외,고등학교_전출_도내,고등학교_전출_도외,고등학교_전입_도내,고등학교_전입_도외,년도
0,종로구,221,132,255,126,63,71,104,73,203,72,166,75,2012
1,중구,295,139,203,100,66,43,58,44,156,37,104,39,2012
2,용산구,380,269,302,174,134,78,91,106,102,66,113,48,2012
3,성동구,643,344,376,221,154,103,98,82,179,37,153,41,2012
4,광진구,560,382,595,312,165,158,158,118,115,70,154,66,2012

-- 순유입인원은 초중고 도내,도외 전입인원에서 초중고 도내, 도외 전출인원을 뺀값이다. 각년도별로 가장 큰 순유입인원을 가진 지역구의 순유입인원을 구하고 전체 기간의 해당 순유입인원들의 합을 구하여라

In [63]:
df['plus'] = df[[x for x in df.columns if '전입' in x]].sum(axis=1) - df[[x for x in df.columns if '전출' in x]].sum(axis=1)
df.groupby('년도').plus.max().sum()

13853

[ 작업유형 2 ]

예측 변수 price, test.csv에 대해 ID별로 price 값을 예측하여 제출, 제출 데이터 컬럼은 ID와 price 두개만 존재해야함. 평가지표는 rmse

In [42]:
import pandas as pd
train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p2_train_.csv')
test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p2_test_.csv')

display(train.head(2))
test.head(2)

,ID,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize
0,10170,A Class,2012,11940,Automatic,46000,Diesel,30,64.2,2.1
1,9551,CL Class,2020,38624,Semi-Auto,19,Petrol,150,36.7,2.0

   ID      model  year transmission  mileage fuelType  tax   mpg  engineSize
0   0        SLK  2005    Automatic    63000   Petrol  325  32.1         1.8
1   2   SL CLASS  2016    Automatic     6200   Petrol  555  28.0         5.5

In [41]:
from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler()
train['mpg'] = scaler.fit_transform(train.mpg.values.reshape(-1,1))
train.mpg

0       0.291859
1       0.164662
2       0.232655
3       0.256244
4       0.329787
          ...
9818    0.106383
9819    0.313599
9820    0.291859
9821    0.368178
9822    0.298797
Name: mpg, Length: 9823, dtype: float64

In [43]:
from sklearn.preprocessing import minmax_scale
train.mpg = minmax_scale(train.mpg)
train.mpg

0       0.291859
1       0.164662
2       0.232655
3       0.256244
4       0.329787
          ...
9818    0.106383
9819    0.313599
9820    0.291859
9821    0.368178
9822    0.298797
Name: mpg, Length: 9823, dtype: float64

In [12]:
num_cols = train.select_dtypes(exclude='object').columns.to_list()
num_cols
from sklearn.preprocessing import RobustScaler
sc = RobustScaler()
train[num_cols] =sc.fit_transform(train[num_cols])
train

,ID,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize
0,0.556249,A Class,-2.000000,-0.913345,Automatic,1.202130,Diesel,-5.75,0.413978,0.333333
1,0.462019,CL Class,0.666667,1.398960,Semi-Auto,-0.591411,Petrol,0.25,-1.064516,0.000000
2,-0.719440,A Class,-1.666667,-1.211438,Manual,2.100480,Petrol,-1.00,-0.274194,-1.333333
3,0.533110,B Class,-1.000000,-0.735009,Automatic,0.762882,Diesel,-1.00,0.000000,0.333333
4,-0.970315,E Class,-0.333333,-0.128423,Semi-Auto,0.240707,Diesel,-6.25,0.854839,0.000000
...,...,...,...,...,...,...,...,...,...,...
9818,-0.137616,S Class,-0.666667,4.980069,Semi-Auto,0.395366,Petrol,21.25,-1.741935,13.333333
9819,0.478764,C Class,-0.666667,-0.561525,Manual,0.769279,Diesel,-6.25,0.666667,0.333333
9820,0.609682,A Class,-1.000000,-0.969237,Automatic,2.797090,Diesel,-6.25,0.413978,0.333333
9821,0.517278,A Class,-0.666667,-0.921231,Manual,0.498381,Diesel,-7.25,1.301075,-1.666667
9822,-0.768458,C Class,-1.000000,-0.782669,Semi-Auto,0.651285,Diesel,-6.25,0.494624,0.333333

In [4]:
train_drop = train.drop(columns = ['ID', 'price'])
test_drop = test.drop(columns = ['ID'])
target = train.price

train_dummy = pd.get_dummies(train_drop)
test_dummy = pd.get_dummies(test_drop)
# test_dummy = test_dummy[train_dummy.columns]   # train, test간 columns이 다를경우, 에러가 발생함
test_dummy = test_dummy.reindex(columns = train_dummy.columns, fill_value=0)

from sklearn.model_selection import train_test_split
X_train, X_validation, Y_train, Y_validation = train_test_split(train_dummy, target, random_state=2023)

from sklearn.ensemble import RandomForestRegressor
rfr = RandomForestRegressor(random_state=2023)
rfr.fit(X_train, Y_train)

from sklearn.metrics import mean_squared_error
predict_train = rfr.predict(X_train)
print(np.sqrt(mean_squared_error(Y_train, predict_train)))

predict_validation = rfr.predict(X_validation)
print(np.sqrt(mean_squared_error(Y_validation, predict_validation)))

predict_test_dummy = rfr.predict(test_dummy)

submission = pd.DataFrame({'ID':test['ID'], 'price':predict_test_dummy})
submission.head()

1034.7940177972089
2471.8982135869232

   ID     price
0   0   3953.60
1   2  60435.20
2  14  17290.35
3  15  14354.53
4  18  15973.73

[ 작업유형 3 ]

어느 학교에서 추출한 55명 학생들의 키 정보이다. 이 학생들의 키의 95% 신뢰구간을 구하고자 한다.

In [2]:
import pandas as pd 
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p3_1.csv')
df.head()

       ID  height
0  user_1  164.57
1  user_2  174.99
2  user_3  171.41
3  user_4  162.47
4  user_5  167.11

-- 55명 학생들의 키에 대한 표본 평균을 구하여라(반올림하여 소숫점 3째자리까지

In [3]:
result = df.height.mean().round(3)
print(result)

169.937

-- t분포 양쪽 꼬리에서의 t 값을 구하여라 (반올림하여 소수4째자리까지)

In [69]:
from scipy.stats import t

std = np.std(df.height, ddof=1)
n = len(df.height)
c_level = 0.95
ddof = n-1

t_value = round(t.ppf((1+c_level)/2, ddof),4)
print(t_value)

2.0049

-- 95% 신뢰구간을 구하여라(print(lower,upper) 방식으로 출력, 각각의 값은 소숫점 이하 3째자리까지)

In [71]:
lower = round(df.height.mean() - t_value * std / np.sqrt(n), 3)
upper = round(df.height.mean() + t_value * std / np.sqrt(n), 3)
print(lower, upper)

168.321 171.553

A,B,C 세 공장에서 생산한 동일한 제품의 길이 데이터 이다. 공장간의 제품 길이 차이가 유의미한지 확인 하려한다.

In [9]:
import pandas as pd 
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p3_2.csv')
df.head()

  ID      value
0  A  84.179434
1  A  93.971003
2  A  62.140957
3  A  72.911723
4  A  79.252747

-- 3 그룹의 데이터에 대해 크루스칼-왈리스 검정을 사용하여 검정 통계량을 반올림하여 소숫점 이하 3자리까지 구하여라

In [17]:
from scipy.stats import kruskal

A = df[df.ID == "A"].value.values
B = df[df.ID == "B"].value.values
C = df[df.ID == "C"].value.values

s, p = kruskal(A, B, C)
s_round = s.round(3)
print(s_round)

6.521

-- 3 그룹의 데이터에 대해 크루스칼-왈리스 검정을 사용하여 p-value를 반올림하여 소숫점 이하 3자리까지 구하여라. 귀무가설과 대립가설중 0.05 유의수준에서 유의한 가설을 출력하라

In [21]:
from scipy.stats import kruskal

A = df[df.ID == "A"].value.values
B = df[df.ID == "B"].value.values
C = df[df.ID == "C"].value.values

s, p = kruskal(A, B, C)
p_round = p.round(3)
print(p_round)
print('대립가설')

0.038
대립가설

4회 기출 변형

[ 작업유형 1 ]

In [35]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p1_1.csv')
df.head(5)

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
0,1,05-02-2010,1643690.90,0,42.31,2.572,211.096358,8.106
1,1,12-02-2010,1641957.44,1,38.51,2.548,211.242170,8.106
2,1,19-02-2010,1611968.17,0,39.93,2.514,211.289143,8.106
3,1,26-02-2010,1409727.59,0,46.63,2.561,211.319643,8.106
4,1,05-03-2010,1554806.68,0,46.5,2.625,211.350143,8.106

-- Temperature컬럼에서 숫자가 아닌 문자들을 제거후 숫자 타입으로 바꾸고 3분위수에서 1분위수의 차이를 소숫점 이하 2자리까지 구하여라

In [53]:
t = df.Temperature.str.replace('*', '').astype('float')
result = round((t.quantile(0.75) - t.quantile(0.25)), 2)
print(result)

27.48

In [72]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p1_2.csv')
df.head(5)

,Title,Video ID,Published At,Keyword,Likes,Comments,Views
0,Apple Pay Is Killing the Physical Wallet After...,wAZZ-UWGVHI,2022-08-23,tech,3407.0,672.0,135612.0
1,The most EXPENSIVE thing I own.,b3x28s61q3c,2022-08-24,tech,76779.0,4306.0,1758063.0
2,My New House Gaming Setup is SICK!,4mgePWWCAmA,2022-08-23,tech,63825.0,3338.0,1564007.0
3,Petrol Vs Liquid Nitrogen | Freezing Experimen...,kXiYSI7H2b0,2022-08-23,tech,71566.0,1426.0,922918.0
4,Best Back to School Tech 2022!,ErMwWXQxHp0,2022-08-08,tech,96513.0,5155.0,1855644.0

-- Likes를 Comments로 나눈 비율이 20이상이면서 Keyword값이 minecraft인 영상들의 Views값의 평균을 정수로 구하여라

In [57]:
result = int(df[(df.Likes/df.Comments >= 20) & (df.Keyword == 'minecraft')].Views.mean())
print(result)

1789084

In [89]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p1_3.csv')
df.head(5)

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...

-- date_added가 2018년 1월 이면서 country가 United Kingdom 단독 제작인 데이터의 갯수

In [94]:
df['date_added'] = pd.to_datetime(df['date_added'], format='%Y-%m-%d', errors='coerce')
df[(df.date_added.dt.strftime('%Y-%m') == '2018-01') & (df.country == 'United Kingdom')].shape[0]

5

[ 작업유형 2 ]

-- 예측 변수 Segmentation, test.csv에 대해 ID별로 Segmentation의 클래스를 예측해서 저장후 제출, 제출 데이터 컬럼은 ID와 Segmentation 두개만 존재해야함. 평가지표는 macro f1 score

In [5]:
import pandas as pd
train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p2_train.csv')
test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p2_test.csv')

display(train.head(2))
test.head(2)

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
0,464357,Male,No,40,Yes,Artist,7.0,Low,1.0,Cat_6,A
1,459624,Male,No,18,No,Healthcare,NaN,Low,5.0,Cat_4,D

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1
0,460406,Male,Yes,36,Yes,Healthcare,3.0,Low,2.0,Cat_6
1,466890,Male,Yes,47,Yes,Artist,0.0,Average,6.0,Cat_7

In [7]:
train_drop = train.dropna().reset_index(drop=True)
test_drop = test.dropna().reset_index(drop=True)
test_drop_id = test_drop['ID']

train_drop2 = train_drop.drop(['ID', 'Segmentation'], axis=1)
test_drop2 = test_drop.drop('ID', axis=1)

y_train = train_drop.pop('Segmentation')
x_train = pd.get_dummies(train_drop2)
x_test = pd.get_dummies(test_drop2)[x_train.columns]

from sklearn.model_selection import train_test_split
X_train, X_validation, Y_train, Y_validation = train_test_split(x_train, y_train, test_size=0.2, random_state=2023)

from sklearn.ensemble import RandomForestClassifier
rfc = RandomForestClassifier(random_state=2023)
rfc.fit(X_train, Y_train)

from sklearn.metrics import f1_score
predict_X_train = rfc.predict(X_train)
print(f1_score(Y_train, predict_X_train, average='macro'))

predict_X_validation = rfc.predict(X_validation)
print(f1_score(Y_validation, predict_X_validation, average='macro'))

predict = rfc.predict(x_test)

submission = pd.DataFrame({'ID':test_drop['ID'], 'Segmentation':predict}).to_csv('20031107.csv', index=False)
check = pd.read_csv('20031107.csv')
check

0.9666041626127243
0.401054127727695

          ID Segmentation
0     460406            D
1     466890            C
2     466145            B
3     467572            C
4     460767            B
...      ...          ...
1283  463734            B
1284  466055            B
1285  465689            D
1286  460401            C
1287  465215            B

[1288 rows x 2 columns]

[ 작업유형 3 ]

어느 대학교의 신입생의 학과별 성별에 대한 데이터이다. 이 데이터를 바탕으로, 학생들의 학과와 성별이 서로 독립적인지 여부를 확인하기 위해 카이제곱 독립성 검정을 실시 하려한다.

In [138]:
import pandas as pd 
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p3_1_.csv')
df.head()

         학번     학과 성별
0  DFSKJK_1   경영학과  여
1  DFSKJK_2   사회학과  여
2  DFSKJK_3  기계공학과  여
3  DFSKJK_4   경제학과  남
4  DFSKJK_5  기계공학과  여

-- 학과 평균 인원에 대한 값을 소숫점 이하 3자리까지 구하여라

In [131]:
result = df.groupby('학과').size().mean().round(3)
print(result)

170.333

-- 카이제곱검정 독립성 검정 통계량을 소숫점 이하 3자리까지 구하여라

In [141]:
from scipy.stats import chi2_contingency

crosstab = pd.crosstab(df['학과'], df['성별'])
s, p, df, ex = chi2_contingency(crosstab)
s_round = round(s, 3)
print(s_round)

5.646

-- 카이제곱검정 독립성 검정의 pvalue를 소숫점 이하 3자리까지 구하여라. 유의수준 0.05하에서 귀무가설과 대립가설중 유의한 것을 출력하라

In [137]:
p_round = p.round(3)
print(p_round)
print('귀무')

0.342
귀무

-- 어느 학교에서 수학 시험을 본 학생 100명 중 60명이 60점 이상을 받았다. 이 학교의 수학 시험의 평균 점수가 50점 이상인지 95%의 신뢰 수준에서 검정하려한다.

★★★★★-- 검정 통계량을 소숫점 이하 3자리에서 구하시오

In [146]:
n = 100
p_hat = 0.6
p = 0.5
a = 0.05

z = round((p_hat - p) / np.sqrt(p * (1 - p) / n), 3)
print(z)

2.0

★★★★★-- pvalue를 소숫점 이하 3자리까지 구하고 귀무가설과 대립가설중 유의한 것을 출력하라

In [148]:
from scipy.stats import norm

p_value = round(1-norm.cdf(z), 3)
print(p_value)
print('대립')

0.023
대립

3회 기출 변형

[ 작업 유형 1 ]

In [ ]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_1.csv')
df.head(5)

-- 결측치가 하나라도 존재하는 행의 경우 경우 해당 행을 삭제하라. 그후 남은 데이터의 상위 70%에 해당하는 데이터만 남겨둔 후 median_income 컬럼의 1분위수를 반올림하여 소숫점이하 2째자리까지 구하여라

In [ ]:
import pandas as pd
df =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_2.csv')
df.head()

-- 1990년도는 해당년도 평균 이하 GDP를 가지지만, 2010년도에는 해당년도 평균 이상 GDP를 가지는 국가의 숫자를 구하여라

In [ ]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p1_3.csv')
df.head()

-- 데이터에서 결측치가 가장 많은 컬럼을 출력하라

[ 작업 유형 2 ]

여행자 보험 가입여부 분류. 종속 변수 : TravelInsurance , TravelInsurance가 1일 확률을 구해서 제출하라. 평가지표 : auc
제출 파일의 컬럼은 ID, proba 두개만 존재해야한다.

In [ ]:
import pandas as pd
train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p2_train_.csv')
test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p2_test_.csv')
train.head()

[ 작업 유형 3 ]

다이어트약의 전후 체중 변화 기록이다. 투약 후 체중에서 투약 전 체중을 뺏을 때 값은 일반 적으로 세가지 등급으로 나눈다. -3이하 : A등급, -3초과 0이하 : B등급, 0 초과 : C등급. 약 실험에서 A,B,C 그룹간의 인원 수 비율은 2:1:1로 알려져 있다. 위 데이터 표본은 각 범주의 비율에 적합한지 카이제곱 검정하려한다.

In [ ]:
import pandas as pd 
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p3_1.csv')
df.head()

-- A등급에 해당하는 유저는 몇명인지 확인하라

-- 카이제곱검정 통계량을 반올림하여 소숫점 이하 3째자리까지 구하여라

-- 카이제곱 검정 p값을 반올림하여 소숫점 이하 3자리까지 구하고, 유의수준 0.05하에서 귀무가설과 대립가설중 유의한 가설을 하나를 선택하시오(귀무/대립)

다이어트약의 전후 체중 변화 기록이다. A,B 공장에서 생산한 기계들의 rpm 값들을 기록한 데이터이다. 대응 표본 t 검정을 통해 B공장 제품들이 A 공장 제품들보다 rpm이 높다고 말할 수 있는지 검정하려한다

In [ ]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p3_2_.csv')
df.head()

-- A,B 공장 각각 정규성을 가지는지 샤피로 검정을 통해 확인하라. (각 공장의 pvalue 출력할 것)

-- A,B 공장 생산 제품의 rpm은 각각 정규성을 가지는지 샤피로 검정을 통해 확인하라. (각 공장의 pvalue 출력할 것)

-- 대응 표본 t 검정을 통해 B공장 제품들의 rpm이 A 공장 제품의 rpm보다 크다고 말할 수 있는지 검정하라. pvalue를 소숫점 이하 3자리까지 출력하고 귀무가설, 대립가설 중 하나를 출력하라

In [14]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e6_p1_1.csv')
df.head(5)

,구급보고서번호,소방서명,환자증상구분명1,신고일자,신고시각,출동일자,출동시각,환자직업명,사고발생장소
0,20211122103M01526,중랑소방서,심계항진,20210330,104800,20210330,105042,무직,집
1,20211111105M00771,노원소방서,복통,20210412,225600,20210412,225827,기타,집
2,20211115104M00864,서초소방서,심계항진,20210303,194100,20210303,194500,직장인,상업시설
3,20211113107M01869,마포소방서,고열,20211225,235400,20211226,331,유아,집
4,20211118102M05820,강동소방서,고열,20211019,12100,20211019,12322,무직,집

In [10]:
pd.to_datetime(df['출동일자'].astype('str') + df['출동시각'].astype('str').str.zfill(6))

0      2021-03-30 10:50:42
1      2021-04-12 22:58:27
2      2021-03-03 19:45:00
3      2021-12-26 00:03:31
4      2021-10-19 01:23:22
               ...
2757   2021-11-02 03:48:00
2758   2021-04-14 19:12:00
2759   2021-05-25 00:01:30
2760   2021-07-15 15:22:44
2761   2021-04-01 22:38:00
Length: 2762, dtype: datetime64[ns]

In [15]:
df['출동일자']

0       20210330
1       20210412
2       20210303
3       20211226
4       20211019
          ...
2757    20211102
2758    20210414
2759    20210525
2760    20210715
2761    20210401
Name: 출동일자, Length: 2762, dtype: int64

In [13]:
df['출동일자'].astype('str')

0       20210330
1       20210412
2       20210303
3       20211226
4       20211019
          ...
2757    20211102
2758    20210414
2759    20210525
2760    20210715
2761    20210401
Name: 출동일자, Length: 2762, dtype: object

In [18]:
df['출동시각'].astype('str').str.zfill(6)

0       105042
1       225827
2       194500
3       000331
4       012322
         ...
2757    034800
2758    191200
2759    000130
2760    152244
2761    223800
Name: 출동시각, Length: 2762, dtype: object

In [19]:
df['출동일자'].astype('str') + df['출동시각'].astype('str').str.zfill(6)

0       20210330105042
1       20210412225827
2       20210303194500
3       20211226000331
4       20211019012322
             ...
2757    20211102034800
2758    20210414191200
2759    20210525000130
2760    20210715152244
2761    20210401223800
Length: 2762, dtype: object

In [48]:
pd.to_datetime(df['출동일자'].astype('str') + df['출동시각'].astype('str').str.zfill(6))

0      2021-03-30 10:50:42
1      2021-04-12 22:58:27
2      2021-03-03 19:45:00
3      2021-12-26 00:03:31
4      2021-10-19 01:23:22
               ...
2757   2021-11-02 03:48:00
2758   2021-04-14 19:12:00
2759   2021-05-25 00:01:30
2760   2021-07-15 15:22:44
2761   2021-04-01 22:38:00
Length: 2762, dtype: datetime64[ns]

In [20]:
pd.to_datetime(df['출동일자'].astype('str') + df['출동시각'].astype('str').str.zfill(6))

0      2021-03-30 10:50:42
1      2021-04-12 22:58:27
2      2021-03-03 19:45:00
3      2021-12-26 00:03:31
4      2021-10-19 01:23:22
               ...
2757   2021-11-02 03:48:00
2758   2021-04-14 19:12:00
2759   2021-05-25 00:01:30
2760   2021-07-15 15:22:44
2761   2021-04-01 22:38:00
Length: 2762, dtype: datetime64[ns]

In [21]:
pd.to_datetime(df['신고일자'].astype('str') + df['신고시각'].astype('str').str.zfill(6))

0      2021-03-30 10:48:00
1      2021-04-12 22:56:00
2      2021-03-03 19:41:00
3      2021-12-25 23:54:00
4      2021-10-19 01:21:00
               ...
2757   2021-11-02 03:47:00
2758   2021-04-14 19:09:00
2759   2021-05-24 23:59:00
2760   2021-07-15 15:20:00
2761   2021-04-01 22:34:00
Length: 2762, dtype: datetime64[ns]

In [26]:
df['소요시간'] = (pd.to_datetime(df['출동일자'].astype('str') + df['출동시각'].astype('str').str.zfill(6)) - pd.to_datetime(df['신고일자'].astype('str') + df['신고시각'].astype('str').str.zfill(6))).dt.total_seconds()

In [34]:
df.groupby('소방서명')['소요시간'].mean().sort_values()

소방서명
서초소방서     164.883495
서대문소방서    165.056604
종로소방서     175.500000
광진소방서     175.602273
노원소방서     179.579310
강동소방서     181.656566
동작소방서     185.107527
송파소방서     189.330508
구로소방서     189.513274
은평소방서     191.390071
양천소방서     192.201389
마포소방서     196.547445
강남소방서     196.933333
강서소방서     199.696203
중랑소방서     204.877049
성북소방서     205.293578
도봉소방서     207.145631
성동소방서     207.358209
중부소방서     207.563636
관악소방서     209.843750
강북소방서     212.061224
동대문소방서    228.148515
용산소방서     237.366197
영등포소방서    258.839286
Name: 소요시간, dtype: float64

In [45]:
result = df.groupby('소방서명')['소요시간'].mean().sort_values().reset_index().loc[2].values
print(result)

['종로소방서' 175.5]

In [49]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e6_p1_2.csv')
df.head(5)

               학교명  시도  학교세부유형  일반학급_학생수_계  교원수_총계_계
0  서울대학교사범대학부설고등학교  서울  일반고등학교         689        73
1           가락고등학교  서울  일반고등학교         765        70
2           개포고등학교  서울  일반고등학교         684        69
3           경기고등학교  서울  일반고등학교        1047        96
4           경동고등학교  서울  일반고등학교         529        58

학교 세부유형이 일반중학교인 학교들 중 일반중학교 숫자가 2번째로 많은 시도의 일반중학교 데이터만 필터하여 해당 시도의 교원 한명 당 맡은 학생수가 가장 많은 학교를 찾아서 해당 학교의 교원수를 출력하라

In [57]:
city = df[df['학교세부유형']=='일반중학교']['시도'].value_counts().index[1]

'서울'

In [72]:
city = df[df['학교세부유형']=='일반중학교']['시도'].value_counts().index[1]
df2 = df[(df['학교세부유형']=='일반중학교') & (df['시도'] == city)]
df2

         학교명  시도 학교세부유형  일반학급_학생수_계  교원수_총계_계
230    동원중학교  서울  일반중학교         379        36
231    면목중학교  서울  일반중학교         462        42
232    봉화중학교  서울  일반중학교         256        31
233    성일중학교  서울  일반중학교         313        30
234    신현중학교  서울  일반중학교         683        52
..       ...  ..    ...         ...       ...
612  동구여자중학교  서울  일반중학교         298        29
613  성신여자중학교  서울  일반중학교         590        46
614  성암여자중학교  서울  일반중학교         403        32
615  창문여자중학교  서울  일반중학교         471        35
616  한성여자중학교  서울  일반중학교         374        32

[387 rows x 5 columns]

In [90]:
city = df[df['학교세부유형']=='일반중학교']['시도'].value_counts().index[1]
df2 = df[(df['학교세부유형']=='일반중학교') & (df['시도'] == city)]
df2['교원비율'] = df['일반학급_학생수_계'] / df['교원수_총계_계']
df2.sort_values('교원비율', ascending=False)

C:\Users\user\AppData\Local\Temp\ipykernel_26264\2172037506.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['교원비율'] = df['일반학급_학생수_계'] / df['교원수_총계_계']

                학교명  시도 학교세부유형  일반학급_학생수_계  교원수_총계_계       교원비율
524  단국대학교사범대학부속중학교  서울  일반중학교         606        33  18.363636
444           한영중학교  서울  일반중학교         742        43  17.255814
532         진선여자중학교  서울  일반중학교         997        58  17.189655
441           배재중학교  서울  일반중학교         868        51  17.019608
526           휘문중학교  서울  일반중학교         814        48  16.958333
..              ...  ..    ...         ...       ...        ...
438           동북중학교  서울  일반중학교         233        43   5.418605
256         정화여자중학교  서울  일반중학교         125        24   5.208333
453           경서중학교  서울  일반중학교         112        26   4.307692
386         금호여자중학교  서울  일반중학교          86        21   4.095238
494           개포중학교  서울  일반중학교           0         0        NaN

[387 rows x 6 columns]

In [88]:
city = df[df['학교세부유형']=='일반중학교']['시도'].value_counts().index[1]
df2 = df[(df['학교세부유형']=='일반중학교') & (df['시도'] == city)]
df2['교원비율'] = df['일반학급_학생수_계'] / df['교원수_총계_계']
result = df2[df2['교원비율'] == df2['교원비율'].max()]['교원수_총계_계'].values[0]
print(result)

33

C:\Users\user\AppData\Local\Temp\ipykernel_26264\4285741214.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['교원비율'] = df['일반학급_학생수_계'] / df['교원수_총계_계']